analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/can_regs.h
/**@} end of group CAN_RXFIFO32_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_RXFIFO16 CAN_RXFIFO16
 * @brief    Receive FIFO Register.
 * @{
 */
#define MXC_F_CAN_RXFIFO16_DATA_POS                    0 /**< RXFIFO16_DATA Position */
#define MXC_F_CAN_RXFIFO16_DATA                        ((uint16_t)(0xFFFFUL << MXC_F_CAN_RXFIFO16_DATA_POS)) /**< RXFIFO16_DATA Mask */

/**@} end of group CAN_RXFIFO16_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_RXFIFO8 CAN_RXFIFO8
 * @brief    Receive FIFO Register.
 * @{
 */
#define MXC_F_CAN_RXFIFO8_DATA_POS                     0 /**< RXFIFO8_DATA Position */
#define MXC_F_CAN_RXFIFO8_DATA                         ((uint8_t)(0xFFUL << MXC_F_CAN_RXFIFO8_DATA_POS)) /**< RXFIFO8_DATA Mask */

/**@} end of group CAN_RXFIFO8_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_ACR32 CAN_ACR32
 * @brief    Acceptance Code Register.
 * @{
 */
#define MXC_F_CAN_ACR32_ACR_POS                        0 /**< ACR32_ACR Position */
#define MXC_F_CAN_ACR32_ACR                            ((uint32_t)(0xFFFFFFFFUL << MXC_F_CAN_ACR32_ACR_POS)) /**< ACR32_ACR Mask */

/**@} end of group CAN_ACR32_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_ACR16 CAN_ACR16
 * @brief    Acceptance Code Register.
 * @{
 */
#define MXC_F_CAN_ACR16_ACR_POS                        0 /**< ACR16_ACR Position */
#define MXC_F_CAN_ACR16_ACR                            ((uint16_t)(0xFFFFUL << MXC_F_CAN_ACR16_ACR_POS)) /**< ACR16_ACR Mask */

/**@} end of group CAN_ACR16_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_ACR8 CAN_ACR8
 * @brief    Acceptance Code Register.
 * @{
 */
#define MXC_F_CAN_ACR8_ACR_POS                         0 /**< ACR8_ACR Position */
#define MXC_F_CAN_ACR8_ACR                             ((uint8_t)(0xFFUL << MXC_F_CAN_ACR8_ACR_POS)) /**< ACR8_ACR Mask */

/**@} end of group CAN_ACR8_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_AMR32 CAN_AMR32
 * @brief    Acceptance Mask Register.
 * @{
 */
#define MXC_F_CAN_AMR32_AMR_POS                        0 /**< AMR32_AMR Position */
#define MXC_F_CAN_AMR32_AMR                            ((uint32_t)(0xFFFFFFFFUL << MXC_F_CAN_AMR32_AMR_POS)) /**< AMR32_AMR Mask */

/**@} end of group CAN_AMR32_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_AMR16 CAN_AMR16
 * @brief    Acceptance Mask Register.
 * @{
 */
#define MXC_F_CAN_AMR16_AMR_POS                        0 /**< AMR16_AMR Position */
#define MXC_F_CAN_AMR16_AMR                            ((uint16_t)(0xFFFFUL << MXC_F_CAN_AMR16_AMR_POS)) /**< AMR16_AMR Mask */

/**@} end of group CAN_AMR16_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_AMR8 CAN_AMR8
 * @brief    Acceptance Mask Register.
 * @{
 */
#define MXC_F_CAN_AMR8_AMR_POS                         0 /**< AMR8_AMR Position */
#define MXC_F_CAN_AMR8_AMR                             ((uint8_t)(0xFFUL << MXC_F_CAN_AMR8_AMR_POS)) /**< AMR8_AMR Mask */

/**@} end of group CAN_AMR8_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_ECC CAN_ECC
 * @brief    Error Code Capture Register.
 * @{
 */
#define MXC_F_CAN_ECC_BER_POS                          0 /**< ECC_BER Position */
#define MXC_F_CAN_ECC_BER                              ((uint8_t)(0x1UL << MXC_F_CAN_ECC_BER_POS)) /**< ECC_BER Mask */

#define MXC_F_CAN_ECC_STFER_POS                        1 /**< ECC_STFER Position */
#define MXC_F_CAN_ECC_STFER                            ((uint8_t)(0x1UL << MXC_F_CAN_ECC_STFER_POS)) /**< ECC_STFER Mask */

#define MXC_F_CAN_ECC_CRCER_POS                        2 /**< ECC_CRCER Position */
#define MXC_F_CAN_ECC_CRCER                            ((uint8_t)(0x1UL << MXC_F_CAN_ECC_CRCER_POS)) /**< ECC_CRCER Mask */

#define MXC_F_CAN_ECC_FRMER_POS                        3 /**< ECC_FRMER Position */
#define MXC_F_CAN_ECC_FRMER                            ((uint8_t)(0x1UL << MXC_F_CAN_ECC_FRMER_POS)) /**< ECC_FRMER Mask */

#define MXC_F_CAN_ECC_ACKER_POS                        4 /**< ECC_ACKER Position */
#define MXC_F_CAN_ECC_ACKER                            ((uint8_t)(0x1UL << MXC_F_CAN_ECC_ACKER_POS)) /**< ECC_ACKER Mask */

#define MXC_F_CAN_ECC_EDIR_POS                         5 /**< ECC_EDIR Position */
#define MXC_F_CAN_ECC_EDIR                             ((uint8_t)(0x1UL << MXC_F_CAN_ECC_EDIR_POS)) /**< ECC_EDIR Mask */

#define MXC_F_CAN_ECC_TXWRN_POS                        6 /**< ECC_TXWRN Position */
#define MXC_F_CAN_ECC_TXWRN                            ((uint8_t)(0x1UL << MXC_F_CAN_ECC_TXWRN_POS)) /**< ECC_TXWRN Mask */

#define MXC_F_CAN_ECC_RXWRN_POS                        7 /**< ECC_RXWRN Position */
#define MXC_F_CAN_ECC_RXWRN                            ((uint8_t)(0x1UL << MXC_F_CAN_ECC_RXWRN_POS)) /**< ECC_RXWRN Mask */

/**@} end of group CAN_ECC_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_RXERR CAN_RXERR
 * @brief    Receive Error Counter.
 * @{
 */
#define MXC_F_CAN_RXERR_RXERR_POS                      0 /**< RXERR_RXERR Position */
#define MXC_F_CAN_RXERR_RXERR                          ((uint8_t)(0xFFUL << MXC_F_CAN_RXERR_RXERR_POS)) /**< RXERR_RXERR Mask */

/**@} end of group CAN_RXERR_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_TXERR CAN_TXERR
 * @brief    Invalidate All Registers.
 * @{
 */
#define MXC_F_CAN_TXERR_TXERR_POS                      0 /**< TXERR_TXERR Position */
#define MXC_F_CAN_TXERR_TXERR                          ((uint8_t)(0xFFUL << MXC_F_CAN_TXERR_TXERR_POS)) /**< TXERR_TXERR Mask */

/**@} end of group CAN_TXERR_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_ALC CAN_ALC
 * @brief    Arbitration Lost Code Capture Register.
 * @{
 */
#define MXC_F_CAN_ALC_ALC_POS                          0 /**< ALC_ALC Position */
#define MXC_F_CAN_ALC_ALC                              ((uint8_t)(0x1FUL << MXC_F_CAN_ALC_ALC_POS)) /**< ALC_ALC Mask */

/**@} end of group CAN_ALC_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_NBT CAN_NBT
 * @brief    Nominal Bit Timing Register.
 * @{
 */
#define MXC_F_CAN_NBT_NBRP_POS                         0 /**< NBT_NBRP Position */
#define MXC_F_CAN_NBT_NBRP                             ((uint32_t)(0x3FFUL << MXC_F_CAN_NBT_NBRP_POS)) /**< NBT_NBRP Mask */

#define MXC_F_CAN_NBT_NSEG1_POS                        10 /**< NBT_NSEG1 Position */
#define MXC_F_CAN_NBT_NSEG1                            ((uint32_t)(0xFFUL << MXC_F_CAN_NBT_NSEG1_POS)) /**< NBT_NSEG1 Mask */

