analogdevicesinc/msdk/Libraries/CMSIS/Device/Maxim/MAX32662/Include/can_regs.h
#define MXC_F_CAN_NBT_NSEG2_POS                        18 /**< NBT_NSEG2 Position */
#define MXC_F_CAN_NBT_NSEG2                            ((uint32_t)(0x7FUL << MXC_F_CAN_NBT_NSEG2_POS)) /**< NBT_NSEG2 Mask */

#define MXC_F_CAN_NBT_NSJW_POS                         25 /**< NBT_NSJW Position */
#define MXC_F_CAN_NBT_NSJW                             ((uint32_t)(0x7FUL << MXC_F_CAN_NBT_NSJW_POS)) /**< NBT_NSJW Mask */

/**@} end of group CAN_NBT_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_DBT_SSPP CAN_DBT_SSPP
 * @brief    Data Bit Timing Register.
 * @{
 */
#define MXC_F_CAN_DBT_SSPP_DBRP_POS                    0 /**< DBT_SSPP_DBRP Position */
#define MXC_F_CAN_DBT_SSPP_DBRP                        ((uint32_t)(0x3FFUL << MXC_F_CAN_DBT_SSPP_DBRP_POS)) /**< DBT_SSPP_DBRP Mask */

#define MXC_F_CAN_DBT_SSPP_DSEG1_POS                   10 /**< DBT_SSPP_DSEG1 Position */
#define MXC_F_CAN_DBT_SSPP_DSEG1                       ((uint32_t)(0x3FUL << MXC_F_CAN_DBT_SSPP_DSEG1_POS)) /**< DBT_SSPP_DSEG1 Mask */

#define MXC_F_CAN_DBT_SSPP_DSEG2_POS                   16 /**< DBT_SSPP_DSEG2 Position */
#define MXC_F_CAN_DBT_SSPP_DSEG2                       ((uint32_t)(0xFUL << MXC_F_CAN_DBT_SSPP_DSEG2_POS)) /**< DBT_SSPP_DSEG2 Mask */

#define MXC_F_CAN_DBT_SSPP_DSJW_POS                    20 /**< DBT_SSPP_DSJW Position */
#define MXC_F_CAN_DBT_SSPP_DSJW                        ((uint32_t)(0xFUL << MXC_F_CAN_DBT_SSPP_DSJW_POS)) /**< DBT_SSPP_DSJW Mask */

#define MXC_F_CAN_DBT_SSPP_SSPP_POS                    24 /**< DBT_SSPP_SSPP Position */
#define MXC_F_CAN_DBT_SSPP_SSPP                        ((uint32_t)(0x7FUL << MXC_F_CAN_DBT_SSPP_SSPP_POS)) /**< DBT_SSPP_SSPP Mask */

/**@} end of group CAN_DBT_SSPP_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_FDCTRL CAN_FDCTRL
 * @brief    FD Control Register.
 * @{
 */
#define MXC_F_CAN_FDCTRL_FDEN_POS                      0 /**< FDCTRL_FDEN Position */
#define MXC_F_CAN_FDCTRL_FDEN                          ((uint8_t)(0x1UL << MXC_F_CAN_FDCTRL_FDEN_POS)) /**< FDCTRL_FDEN Mask */

#define MXC_F_CAN_FDCTRL_BRSEN_POS                     1 /**< FDCTRL_BRSEN Position */
#define MXC_F_CAN_FDCTRL_BRSEN                         ((uint8_t)(0x1UL << MXC_F_CAN_FDCTRL_BRSEN_POS)) /**< FDCTRL_BRSEN Mask */

#define MXC_F_CAN_FDCTRL_EXTBT_POS                     2 /**< FDCTRL_EXTBT Position */
#define MXC_F_CAN_FDCTRL_EXTBT                         ((uint8_t)(0x1UL << MXC_F_CAN_FDCTRL_EXTBT_POS)) /**< FDCTRL_EXTBT Mask */

#define MXC_F_CAN_FDCTRL_ISO_POS                       3 /**< FDCTRL_ISO Position */
#define MXC_F_CAN_FDCTRL_ISO                           ((uint8_t)(0x1UL << MXC_F_CAN_FDCTRL_ISO_POS)) /**< FDCTRL_ISO Mask */

#define MXC_F_CAN_FDCTRL_DAR_POS                       4 /**< FDCTRL_DAR Position */
#define MXC_F_CAN_FDCTRL_DAR                           ((uint8_t)(0x1UL << MXC_F_CAN_FDCTRL_DAR_POS)) /**< FDCTRL_DAR Mask */

#define MXC_F_CAN_FDCTRL_REOM_POS                      5 /**< FDCTRL_REOM Position */
#define MXC_F_CAN_FDCTRL_REOM                          ((uint8_t)(0x1UL << MXC_F_CAN_FDCTRL_REOM_POS)) /**< FDCTRL_REOM Mask */

#define MXC_F_CAN_FDCTRL_PED_POS                       6 /**< FDCTRL_PED Position */
#define MXC_F_CAN_FDCTRL_PED                           ((uint8_t)(0x1UL << MXC_F_CAN_FDCTRL_PED_POS)) /**< FDCTRL_PED Mask */

/**@} end of group CAN_FDCTRL_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_FDSTAT CAN_FDSTAT
 * @brief    Invalidate All Registers.
 * @{
 */
#define MXC_F_CAN_FDSTAT_BITERR_POS                    0 /**< FDSTAT_BITERR Position */
#define MXC_F_CAN_FDSTAT_BITERR                        ((uint8_t)(0x1UL << MXC_F_CAN_FDSTAT_BITERR_POS)) /**< FDSTAT_BITERR Mask */

#define MXC_F_CAN_FDSTAT_CRCERR_POS                    1 /**< FDSTAT_CRCERR Position */
#define MXC_F_CAN_FDSTAT_CRCERR                        ((uint8_t)(0x1UL << MXC_F_CAN_FDSTAT_CRCERR_POS)) /**< FDSTAT_CRCERR Mask */

#define MXC_F_CAN_FDSTAT_FRMERR_POS                    2 /**< FDSTAT_FRMERR Position */
#define MXC_F_CAN_FDSTAT_FRMERR                        ((uint8_t)(0x1UL << MXC_F_CAN_FDSTAT_FRMERR_POS)) /**< FDSTAT_FRMERR Mask */

#define MXC_F_CAN_FDSTAT_STFERR_POS                    3 /**< FDSTAT_STFERR Position */
#define MXC_F_CAN_FDSTAT_STFERR                        ((uint8_t)(0x1UL << MXC_F_CAN_FDSTAT_STFERR_POS)) /**< FDSTAT_STFERR Mask */

#define MXC_F_CAN_FDSTAT_PEE_POS                       4 /**< FDSTAT_PEE Position */
#define MXC_F_CAN_FDSTAT_PEE                           ((uint8_t)(0x1UL << MXC_F_CAN_FDSTAT_PEE_POS)) /**< FDSTAT_PEE Mask */

#define MXC_F_CAN_FDSTAT_STATE_POS                     6 /**< FDSTAT_STATE Position */
#define MXC_F_CAN_FDSTAT_STATE                         ((uint8_t)(0x3UL << MXC_F_CAN_FDSTAT_STATE_POS)) /**< FDSTAT_STATE Mask */
#define MXC_V_CAN_FDSTAT_STATE_INT                     ((uint8_t)0x0UL) /**< FDSTAT_STATE_INT Value */
#define MXC_S_CAN_FDSTAT_STATE_INT                     (MXC_V_CAN_FDSTAT_STATE_INT << MXC_F_CAN_FDSTAT_STATE_POS) /**< FDSTAT_STATE_INT Setting */
#define MXC_V_CAN_FDSTAT_STATE_IDLE                    ((uint8_t)0x1UL) /**< FDSTAT_STATE_IDLE Value */
#define MXC_S_CAN_FDSTAT_STATE_IDLE                    (MXC_V_CAN_FDSTAT_STATE_IDLE << MXC_F_CAN_FDSTAT_STATE_POS) /**< FDSTAT_STATE_IDLE Setting */
#define MXC_V_CAN_FDSTAT_STATE_RX                      ((uint8_t)0x2UL) /**< FDSTAT_STATE_RX Value */
#define MXC_S_CAN_FDSTAT_STATE_RX                      (MXC_V_CAN_FDSTAT_STATE_RX << MXC_F_CAN_FDSTAT_STATE_POS) /**< FDSTAT_STATE_RX Setting */
#define MXC_V_CAN_FDSTAT_STATE_TX                      ((uint8_t)0x3UL) /**< FDSTAT_STATE_TX Value */
#define MXC_S_CAN_FDSTAT_STATE_TX                      (MXC_V_CAN_FDSTAT_STATE_TX << MXC_F_CAN_FDSTAT_STATE_POS) /**< FDSTAT_STATE_TX Setting */

/**@} end of group CAN_FDSTAT_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_DPERR CAN_DPERR
 * @brief    Data Phase Error Counter Register.
 * @{
 */
#define MXC_F_CAN_DPERR_DPERR_POS                      0 /**< DPERR_DPERR Position */
#define MXC_F_CAN_DPERR_DPERR                          ((uint8_t)(0xFFUL << MXC_F_CAN_DPERR_DPERR_POS)) /**< DPERR_DPERR Mask */

/**@} end of group CAN_DPERR_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_APERR CAN_APERR
 * @brief    Arbitration Phase Error Counter Register.
 * @{
 */
#define MXC_F_CAN_APERR_APERR_POS                      0 /**< APERR_APERR Position */
#define MXC_F_CAN_APERR_APERR                          ((uint8_t)(0xFFUL << MXC_F_CAN_APERR_APERR_POS)) /**< APERR_APERR Mask */

/**@} end of group CAN_APERR_Register */

/**
 * @ingroup  can_registers
 * @defgroup CAN_TEST CAN_TEST
 * @brief    Invalidate All Registers.
 * @{
 */
#define MXC_F_CAN_TEST_LBEN_POS                        0 /**< TEST_LBEN Position */
#define MXC_F_CAN_TEST_LBEN                            ((uint8_t)(0x1UL << MXC_F_CAN_TEST_LBEN_POS)) /**< TEST_LBEN Mask */

#define MXC_F_CAN_TEST_TXC_POS                         1 /**< TEST_TXC Position */
#define MXC_F_CAN_TEST_TXC                             ((uint8_t)(0x1UL << MXC_F_CAN_TEST_TXC_POS)) /**< TEST_TXC Mask */

